<?php

/*
|--------------------------------------------------------------------------
| Web Routes
|--------------------------------------------------------------------------
|
| This file is where you may define all of the routes that are handled
| by your application. Just tell Laravel the URIs it should respond
| to using a Closure or controller method. Build something great!
|
*/

/*
|--------------------------------------------------------------------------
| Auth
|--------------------------------------------------------------------------
|
| Laravel自动生成的注册、登录、找回密码等功能的路由
|
*/
Auth::routes();

/*
|--------------------------------------------------------------------------
| 首页
|--------------------------------------------------------------------------
|
| 将首页直接跳转至登录页面
|
*/
Route::get('/', function () {
    return redirect('/login');
})->middleware('guest');

/*
|--------------------------------------------------------------------------
| 登录后用户首页
|--------------------------------------------------------------------------
|
| 登录后的用户跳转至此页面
|
*/
Route::get('/home', 'HomeController@index');

/*
|--------------------------------------------------------------------------
| 管理后台
|--------------------------------------------------------------------------
|
| Url为:/admin/*
|
*/
Route::group([
        'prefix'=> 'admin',
        'namespace'=>'Admin',
        'middleware'=>'role:admin'
    ], function(){
    Route::resource('users', 'UserController');
});
